# Задание 1 Правильно поставить скобки
a, b, c, d = False, True, False, True
print(a and b and not (c or d))

# Задание 2 Больше Меньше
print("Введите числа для сравнения")
x = int(input())
y = int(input())

print(x > y)
