#Задание 1 исправить ошибку
x = 25
print(x+25)

#Задание 2 Считывание с кансоли + преобразование строки в число
print("Введите числа для их сложения")
x = int(input())
y = int(input())

print("Результат: ")
print(x+y)

#Задание 3 Преобразование времени сна в минуты
print("Введите количество часов сна")
x = int(input())
print("Введите количество минут сна")
y = int(input())
print("Время сна в минутах")
print((x * 60) + y)

