# Задача 1 Сложение строк
print("Введите символы или буквы")
x = input()
y = input()

print(x, y)

# Задача 2 Сумма длин строк
print("Введите символы или буквы")
x = input()
y = input()

print("Сумма длин строк: ", (len(x) + len(y)))

# Задача 3 На умножение строк
print("Введите строку")
x = input()
print("Введите вторую строку")
y = input()
print("Введите число, на которые вы бы хотели перемножить строки")
n = int(input())
print(("Результат: "), ((x + y) * n))
